Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KM204.h
/* IPC15 */
#define _RTCIP IPC15bits.RTCIP
#define _RTCIP0 IPC15bits.RTCIP0
#define _RTCIP1 IPC15bits.RTCIP1
#define _RTCIP2 IPC15bits.RTCIP2

/* IPC16 */
#define _U1ERIP IPC16bits.U1ERIP
#define _U2ERIP IPC16bits.U2ERIP
#define _U1ERIP0 IPC16bits.U1ERIP0
#define _U1ERIP1 IPC16bits.U1ERIP1
#define _U1ERIP2 IPC16bits.U1ERIP2
#define _U2ERIP0 IPC16bits.U2ERIP0
#define _U2ERIP1 IPC16bits.U2ERIP1
#define _U2ERIP2 IPC16bits.U2ERIP2

/* IPC18 */
#define _HLVDIP IPC18bits.HLVDIP
#define _HLVDIP0 IPC18bits.HLVDIP0
#define _HLVDIP1 IPC18bits.HLVDIP1
#define _HLVDIP2 IPC18bits.HLVDIP2

/* IPC19 */
#define _CTMUIP IPC19bits.CTMUIP
#define _DAC1IP IPC19bits.DAC1IP
#define _DAC2IP IPC19bits.DAC2IP
#define _CTMUIP0 IPC19bits.CTMUIP0
#define _CTMUIP1 IPC19bits.CTMUIP1
#define _CTMUIP2 IPC19bits.CTMUIP2
#define _DAC1IP0 IPC19bits.DAC1IP0
#define _DAC1IP1 IPC19bits.DAC1IP1
#define _DAC1IP2 IPC19bits.DAC1IP2
#define _DAC2IP0 IPC19bits.DAC2IP0
#define _DAC2IP1 IPC19bits.DAC2IP1
#define _DAC2IP2 IPC19bits.DAC2IP2

/* IPC20 */
#define _ULPWUIP IPC20bits.ULPWUIP
#define _ULPWUIP0 IPC20bits.ULPWUIP0
#define _ULPWUIP1 IPC20bits.ULPWUIP1
#define _ULPWUIP2 IPC20bits.ULPWUIP2

/* IPC24 */
#define _CLC1IP IPC24bits.CLC1IP
#define _CLC2IP IPC24bits.CLC2IP
#define _CLC1IP0 IPC24bits.CLC1IP0
#define _CLC1IP1 IPC24bits.CLC1IP1
#define _CLC1IP2 IPC24bits.CLC1IP2
#define _CLC2IP0 IPC24bits.CLC2IP0
#define _CLC2IP1 IPC24bits.CLC2IP1
#define _CLC2IP2 IPC24bits.CLC2IP2

/* INTTREG */
#define _VECNUM INTTREGbits.VECNUM
#define _ILR INTTREGbits.ILR
#define _VHOLD INTTREGbits.VHOLD
#define _CPUIRQ INTTREGbits.CPUIRQ
#define _VECNUM0 INTTREGbits.VECNUM0
#define _VECNUM1 INTTREGbits.VECNUM1
#define _VECNUM2 INTTREGbits.VECNUM2
#define _VECNUM3 INTTREGbits.VECNUM3
#define _VECNUM4 INTTREGbits.VECNUM4
#define _VECNUM5 INTTREGbits.VECNUM5
#define _VECNUM6 INTTREGbits.VECNUM6
#define _ILR0 INTTREGbits.ILR0
#define _ILR1 INTTREGbits.ILR1
#define _ILR2 INTTREGbits.ILR2
#define _ILR3 INTTREGbits.ILR3

/* T1CON */
#define _TCS T1CONbits.TCS
#define _TSYNC T1CONbits.TSYNC
#define _TCKPS T1CONbits.TCKPS
#define _TGATE T1CONbits.TGATE
#define _TECS T1CONbits.TECS
#define _TSIDL T1CONbits.TSIDL
#define _TON T1CONbits.TON
#define _TCKPS0 T1CONbits.TCKPS0
#define _TCKPS1 T1CONbits.TCKPS1
#define _T1ECS0 T1CONbits.T1ECS0
#define _T1ECS1 T1CONbits.T1ECS1
#define _T1ECS T1CONbits.T1ECS
#define _TECS0 T1CONbits.TECS0
#define _TECS1 T1CONbits.TECS1
#define _TIECS T1CONbits.TIECS
#define _TIECS0 T1CONbits.TIECS0
#define _TIECS1 T1CONbits.TIECS1

/* CLC1CONL */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _LCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _LCOUT cannot be defined because it is used by more than one SFR */
/* Bitname _LCOE cannot be defined because it is used by more than one SFR */
/* Bitname _INTN cannot be defined because it is used by more than one SFR */
/* Bitname _INTP cannot be defined because it is used by more than one SFR */
/* Bitname _LCEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE2 cannot be defined because it is used by more than one SFR */

/* CLC1CONH */
/* Bitname _G1POL cannot be defined because it is used by more than one SFR */
/* Bitname _G2POL cannot be defined because it is used by more than one SFR */
/* Bitname _G3POL cannot be defined because it is used by more than one SFR */
/* Bitname _G4POL cannot be defined because it is used by more than one SFR */

/* CLC1SEL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

/* CLC1GLSL */
/* Bitname _G1D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4T cannot be defined because it is used by more than one SFR */

/* CLC1GLSH */
/* Bitname _G3D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G3D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G4D4T cannot be defined because it is used by more than one SFR */

/* CLC2CONL */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _LCPOL cannot be defined because it is used by more than one SFR */
/* Bitname _LCOUT cannot be defined because it is used by more than one SFR */
/* Bitname _LCOE cannot be defined because it is used by more than one SFR */
/* Bitname _INTN cannot be defined because it is used by more than one SFR */
/* Bitname _INTP cannot be defined because it is used by more than one SFR */
/* Bitname _LCEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE2 cannot be defined because it is used by more than one SFR */

/* CLC2CONH */
/* Bitname _G1POL cannot be defined because it is used by more than one SFR */
/* Bitname _G2POL cannot be defined because it is used by more than one SFR */
/* Bitname _G3POL cannot be defined because it is used by more than one SFR */
/* Bitname _G4POL cannot be defined because it is used by more than one SFR */

/* CLC2SEL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

/* CLC2SELL */
/* Bitname _DS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DS2 cannot be defined because it is used by more than one SFR */
/* Bitname _DS3 cannot be defined because it is used by more than one SFR */
/* Bitname _DS4 cannot be defined because it is used by more than one SFR */
/* Bitname _DS10 cannot be defined because it is used by more than one SFR */
/* Bitname _DS11 cannot be defined because it is used by more than one SFR */
/* Bitname _DS12 cannot be defined because it is used by more than one SFR */
/* Bitname _DS20 cannot be defined because it is used by more than one SFR */
/* Bitname _DS21 cannot be defined because it is used by more than one SFR */
/* Bitname _DS22 cannot be defined because it is used by more than one SFR */
/* Bitname _DS30 cannot be defined because it is used by more than one SFR */
/* Bitname _DS31 cannot be defined because it is used by more than one SFR */
/* Bitname _DS32 cannot be defined because it is used by more than one SFR */
/* Bitname _DS40 cannot be defined because it is used by more than one SFR */
/* Bitname _DS41 cannot be defined because it is used by more than one SFR */
/* Bitname _DS42 cannot be defined because it is used by more than one SFR */

/* CLC2GLSL */
/* Bitname _G1D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G1D4T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D1T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D2T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D3T cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4N cannot be defined because it is used by more than one SFR */
/* Bitname _G2D4T cannot be defined because it is used by more than one SFR */

